api/modules/v1/models/Comenzi.php

    public function fields() {
        $fields = parent::fields();
        $fields['status_text'] = function($model){
          //  \yii\helpers\VarDumper::dump($model);
            if (is_null($model->status0)){
                return 'Necunoscut';
            }
            return $model->status0->status0->nume;
        };
        $fields['mod_plata_text'] = function($model){
            if (is_null($model->modPlata0)){
                return 'Necunoscut';
            }
            return $model->modPlata0->nume;
        };
//        $fields['mod_plata'] = function ($model){
//            return $model->modPlata0->nume;
//        };
        $fields['linii_comanda'] = function($model) {
            return ComenziLinii::find()->where(['comanda'=>$model->id])->all();
---
SELECT * FROM `comenzi_linii` WHERE `comanda`=83