common/models/User.php

SELECT * FROM `user` WHERE `auth_key`='aymAFi68sp3MR4rvTG2A7Q3FMSXb8MoE'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token]);

SELECT * FROM `user` WHERE (`email`='email@gmail.com') AND (`status`=10)
---
    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);