api/modules/v1/controllers/CategoriiController.php

    public function actionCategoryProductCount() {
        $result = [];

        // Query to get the category names and the count of products in each category
        $categories = $this->modelClass::find()
                ->select(['categorii.id', 'categorii.nume AS category_name', 'COUNT(produse.id) AS product_count'])
                ->leftJoin('produse', 'categorii.id = produse.categorie')
                ->where(['categorii.valid' => 1])->andWhere(['OR', ['IS', 'produse.id', null], ['produse.valid' => 1]])
                ->groupBy('categorii.id')
                ->asArray()
                ->asArray()
                ->all();
---
SELECT `categorii`.`id`, `categorii`.`nume` AS `category_name`, COUNT(produse.id) AS `product_count` FROM `categorii` LEFT JOIN `produse` ON categorii.id = produse.categorie WHERE (`categorii`.`valid`=1) AND ((`produse`.`id` IS NULL) OR (`produse`.`valid`=1)) GROUP BY `categorii`.`id`

    public function actionMinMaxPrices() {

        //$categoryIds = Yii::$app->request->get('categorii');

        $categoryIds = \Yii::$app->request->get('categorii');
       // var_dump($categoryIds);
        // Ensure $categoryIds is an array
        if (!is_array($categoryIds)) {
            $categoryIds = [];
        }

        // Create a base query to calculate min and max prices for valid products
        $query = \api\modules\v1\models\Produse::find()
                ->select([
                //    'categorie',
                    'MIN(pret_curent) AS min_price',
                    'MAX(pret_curent) AS max_price',
                ])
                ->where(['valid' => 1]);
---
SELECT MIN(pret_curent) AS `min_price`, MAX(pret_curent) AS `max_price` FROM `produse` WHERE `valid`=1
SELECT `categorie`, MIN(pret_curent) AS `min_price`, MAX(pret_curent) AS `max_price` FROM `produse` WHERE `valid`=1 GROUP BY `categorie`