api/modules/v1/controllers/ComenziController.php

SELECT * FROM `produse` WHERE `id`=27
SELECT SUM(cantitate_ramasa) FROM `stocuri` WHERE `produs`=27
---
    public function actionCreate() {
        $model = new Comenzi();
        $produseComanda = Yii::$app->request->post('produse');
        foreach ($produseComanda as $produs){
            if (\backend\models\Produse::findOne(['id' => $produs['id']])->stocabil){
                if (\backend\models\Stocuri::find()->where(['produs' => $produs['id']])->sum('cantitate_ramasa') < $produs['cantitate']){

SELECT * FROM `comenzi` WHERE `utilizator`=1
---
    public function actionIndex() {
        $query = Comenzi::find()->where(['utilizator' => Yii::$app->user->id]);

SELECT * FROM `comenzi` WHERE `comenzi`.`id` IS NULL
---
    public function actionChangeStatus($id) {
        $model = Comenzi::findOne($id);

SELECT * FROM `comenzi` WHERE `id`='83'
---
    public function actionAdaugareProdusComanda($id){
        $model = Comenzi::findOne($id);

SELECT * FROM `comenzi` WHERE `comenzi`.`id`=83
SELECT * FROM `comenzi_linii` WHERE (`comanda`='83') AND (`produs`=10)
---
    public function actionStergereProdusComanda($id){
        $model = Comenzi::findOne($id);
        if ($model->status0->status0->id!=3){
            $model->addError('eroare', 'Comanda este deja in curs de pregatire');
            return $model;
        }
        $id_produs = Yii::$app->request->post('id_produs');
        $cantitate = Yii::$app->request->post('cantitate');
        if (is_null(\backend\models\ComenziLinii::findOne(['comanda' => $id, 'produs' => $id_produs]))){