api/modules/v1/controllers/ProduseController.php

SELECT * FROM `produse` WHERE `id`='40'
---
    public function actionUpdate($id) {
        $model = Produse::findOne($id);