backend/models/Comenzi.php

    public function saveComanda($data) {
        $transaction = Yii::$app->db->beginTransaction();

        try {
            $pret = 0;
            $produseComanda = Yii::$app->request->post('produse');
            $this->numar_comanda = 23;
            $this->canal = 'web';
            $this->data_ora_creare = new Expression('NOW()');
            $this->tva = 0.09;
            $this->utilizator = Yii::$app->user->id;
            //          $this->status =3;
            $this->pret = 0;
//            $this->mod_plata = 'card';
//            $this->mentiuni = '';
            if ($this->load(Yii::$app->request->post(), '') && $this->save()) {
               // \yii\helpers\VarDumper::dump('AM ajuns aici');
                foreach ($produseComanda as $produs) {
                    $modelComandaLinie = new ComenziLinii();
                    $modelComandaLinie->comanda = $this->id;
                    $modelComandaLinie->cantitate = $produs['cantitate'];
                    $modelComandaLinie->produs = $produs['id'];
                    $modelComandaLinie->pret = Produse::find()->where(['id' => $produs['id']])->one()->pret_curent * $produs['cantitate'];
                    $pret += $modelComandaLinie->pret;
                    $modelComandaLinie->save();
---
INSERT INTO `comenzi` (`numar_comanda`, `canal`, `data_ora_creare`, `tva`, `utilizator`, `pret`, `mentiuni`, `mod_plata`) VALUES (23, 'web', NOW(), '0.09', 1, 0, 'pizza fara ciuperci', 'card')
SELECT EXISTS(SELECT * FROM `produse` WHERE `produse`.`id`=8)
SELECT * FROM `produse` WHERE `id`=8
INSERT INTO `comenzi_linii` (`comanda`, `cantitate`, `produs`, `pret`) VALUES (31, 2, 8, '90')

                $this->status = $statusCurent->id;
//                $this->validate();
//                \yii\helpers\VarDumper::dump( $this->errors);
                if ($this->save()) {
---
UPDATE `comenzi` SET `pret`='186', `status`=23 WHERE `id`=31

    public function changeStatus($id) {
        $transaction = Yii::$app->db->beginTransaction();

        try {

            $comanda = $this->findOne(['id' => $id]);
//            \yii\helpers\VarDumper::dump($comanda->id);
            $statusVechi = ComenziDetalii::findOne(['id' => $comanda->status]);
        //    \yii\helpers\VarDumper::dump($statusVechi->id);
            $statusVechi->data_ora_sfarsit = new Expression('NOW()');
            $statusVechi->save();
---
SELECT * FROM `comenzi` WHERE `id`='6'
SELECT * FROM `comenzi_detalii` WHERE `id` IS NULL
UPDATE `comenzi_detalii` SET `data_ora_sfarsit`=NOW() WHERE `id`=18