backend/models/Comenzi.php

SELECT EXISTS(SELECT * FROM `produse` WHERE `produse`.`id`=10)
---
    public function adaugareProdusComanda($id) {
        $transaction = Yii::$app->db->beginTransaction();
        $comanda = $this->findOne(['id' => $id]);
        $id_produs = Yii::$app->request->post('id_produs');
        $cantitate = Yii::$app->request->post('cantitate');

        try {
            if (!is_null(ComenziLinii::findOne(['comanda' => $id, 'produs' => $id_produs]))) {
                $comandaLinie = ComenziLinii::findOne(['comanda' => $id, 'produs' => $id_produs]);
                $comandaLinie->cantitate += $cantitate;
                $comandaLinie->pret += Produse::find()->where(['id' => $id_produs])->one()->pret_curent * $cantitate;