backend/models/Comenzi.php

SELECT * FROM `comenzi` WHERE `comenzi`.`id`=31
SELECT EXISTS(SELECT * FROM `comenzi` WHERE `comenzi`.`id`=31)
SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=1)
---
    public function salveazaComandaFaraSesiune($mentiuni, $adresa, $telefon, $produse) {
        $transaction = Yii::$app->db->beginTransaction();

        $this->numar_comanda = (int) (date('Ymd') . mt_rand(10000, 99999));
        $this->utilizator = Yii::$app->user->id;
        $this->data_ora_creare = new Expression('NOW()');
        if (!empty($mentiuni))
            $this->mentiuni = $mentiuni;
        $this->adresa = $adresa;
        $this->numar_telefon = $telefon;
        if ($this->save()) {
            $restaurantUser = RestauranteUser::findOne(['user' => Yii::$app->user->id]);

UPDATE `comenzi` SET `status`=NULL WHERE `id`=26
---
            $this->pret = $pret;
            $this->tva = 0.09; //* $this->pret;
            $this->status = $comandaDetaliu->id;
            if ($this->save() && $restaurantComanda->save() && $save) {

UPDATE `comenzi` SET `status`=100, `pret`='70' WHERE `id`=83
---
    public function salveazaComanda($mentiuni, $adresa, $telefon) {
        $transaction = Yii::$app->db->beginTransaction();
        // \yii\helpers\VarDumper::dump("sunt aici");
        try {
            //  \yii\helpers\VarDumper::dump("sunt aici");
            $sesiune = Sesiuni::findOne(['user' => \Yii::$app->user->id, 'data_ora_sfarsit' => NULL]);
            // if(is_null($sesiune)){
            //     $sesiune=new Sesiuni();
            //     $sesiune->user=\Yii::$app->user->id;
            // }

            $sesiuniProduse = SesiuniProduse::find()->where(['sesiune' => $sesiune])->all();

            $pret = 0;
            $this->numar_comanda = 23;
            $this->canal = 'web';
            $this->data_ora_creare = new Expression('NOW()');
            $this->tva = 0.09;
            $this->utilizator = Yii::$app->user->id;
            $this->mentiuni = $mentiuni;
            $this->adresa = $adresa;
            $this->numar_telefon = $telefon;
            $this->mod_plata = 1;
            //          $this->status =3;
            $this->pret = 0;
            //        $this->mod_plata = 1;
//            $this->mentiuni = '';
            //  \yii\helpers\VarDumper::dump("sunt aici");
            if ($this->save()) {

SELECT * FROM `produse` WHERE `id`=10
---
                        $modelComandaLinie->comanda = $this->id;
                        $modelComandaLinie->cantitate = $sesiuneProdus->cantitate;
                        $modelComandaLinie->produs = $sesiuneProdus->produs;
                        $modelComandaLinie->pret = Produse::find()->where(['id' => $sesiuneProdus->produs])->one()->pret_curent * $sesiuneProdus->cantitate;