backend/models/Produse.php

    public function getPretCurent() {
        return $this->getPreturiProduses()->where('valid = 1')->one();
---
SELECT * FROM `preturi_produse` WHERE (valid = 1) AND (`produs`=40)